#include <stdio.h>

int main() {
    int a, b, v;
    scanf("%d %d %d", &a, &b, &v);

    // x일이 지났을 때, 올라간 높이는
    // (x - 1)(a - b) + a = v가 되는 x 값을 구하면 된다.
    // 이 식을 풀면, xa - bx - a + b + a = v
    // (a - b)x = v - b
    // x = (v - b) / (a - b)
    // 부등호가 붙는다면, x >= (v - b) / (a - b)를 만족하는 가장 작은 정수 x일 것.

    int u = v - b;
    int d = a - b;

    if (d <= 0) {
        printf("Not possible!\n");
    } else {
        if (u % d == 0) {
            printf("%d\n", u / d);
        } else {
            printf("%d\n", u / d + 1);
        }
    }
    
    return 0;
}


/*
문제
땅 위에 달팽이가 있다. 이 달팽이는 높이가 V미터인 나무 막대를 올라갈 것이다.

달팽이는 낮에 A미터 올라갈 수 있다. 하지만, 밤에 잠을 자는 동안 B미터 미끄러진다. 또, 정상에 올라간 후에는 미끄러지지 않는다.

달팽이가 나무 막대를 모두 올라가려면, 며칠이 걸리는지 구하는 프로그램을 작성하시오.

입력
첫째 줄에 세 정수 A, B, V가 공백으로 구분되어서 주어진다. (1 ≤ B < A ≤ V ≤ 1,000,000,000)

출력
첫째 줄에 달팽이가 나무 막대를 모두 올라가는데 며칠이 걸리는지 출력한다.
*/
