#include <stdio.h>
#define MEMO_MAX 100000
int main() {
    int T;
    scanf("%d", &T);
    for (int tc = 0; tc < T; tc++) {
        int memo[MEMO_MAX]
    }
    return 0;
}

/*
가장 적게 공간이동 하려면 당연히 가속을 풀로 땡기다가, 서서히 감속해야 할 것.
그리고 직전에는 k = 1이 되어야 하고..
그러면 요런 형태임
1 2 3 4 5 6 5 4 3 2 1 ... => 이 최대값보다 적은 횟수로.. 갈 수 있는 요런 느낌
그럼 요 형태의 배열을 가지고 있으면 될 듯...? (최대거리가 되는거니)

공간이동 장치 발동 수에 따른 max 거리
1                => 1   (  1)
1 1              => 2  ( + 1)
1 2 1            => 4  ( + 2)
1 2 2 1          => 6  ( + 2)
1 2 3 2 1        => 9  ( + 3)
1 2 3 3 2 1      => 12 ( + 3)
1 2 3 4 3 2 1    => 16 ( + 4)

*/
